[
  { 
    "id": 1, 
    "title": "Coursera scholarships", 
    "author": "e-office", 
    "type": "administrative",
    "content": "Уважаемые студенты! Открыт прием заявок на получение стипендий Coursera для прохождения онлайн-курсов. Стипендии покрывают полную стоимость обучения на платформе Coursera. Количество стипендий ограничено. Заявки принимаются до 15 декабря. Для подачи заявки необходимо заполнить форму на сайте университета и приложить мотивационное письмо. Результаты будут объявлены 20 декабря."
  },
  { 
    "id": 2, 
    "title": "Mid-term schedule", 
    "author": "Registrar", 
    "type": "academic",
    "content": "Опубликовано расписание промежуточных экзаменов на текущий семестр. Экзамены пройдут с 10 по 20 декабря в соответствии с установленным графиком. Обратите внимание на изменения в расписании некоторых предметов. Все экзамены будут проводиться в аудиториях главного корпуса. При себе необходимо иметь студенческий билет и письменные принадлежности."
  },
  { 
    "id": 3, 
    "title": "Fire drill today at 15:00", 
    "author": "Admin", 
    "type": "urgent",
    "content": "ВНИМАНИЕ! Сегодня в 15:00 состоится плановая учебная эвакуация. Все студенты и сотрудники должны покинуть здание по сигналу тревоги. Сборный пункт - стадион университета. Эвакуация продлится примерно 15-20 минут. Просьба отнестись к мероприятию серьезно и следовать указаниям ответственных лиц. После завершения эвакуации все смогут вернуться в здание."
  },
  { 
    "id": 4, 
    "title": "Open Day this Saturday", 
    "author": "PR Office", 
    "type": "event",
    "content": "Приглашаем всех желающих на День открытых дверей, который состоится в эту субботу с 10:00 до 16:00. В программе: презентации факультетов, мастер-классы, экскурсии по кампусу, встреча с преподавателями и студентами. Для абитуриентов будет организована консультация по вопросам поступления. Вход свободный. Регистрация на сайте университета."
  },
  { 
    "id": 5, 
    "title": "New library books available", 
    "author": "Library", 
    "type": "general",
    "content": "Библиотека пополнилась новыми изданиями по различным направлениям. Поступили учебники по программированию, экономике, психологии, а также художественная литература. Новые книги доступны для выдачи с понедельника. Список новых поступлений размещен на сайте библиотеки. Рекомендуем ознакомиться с новинками и забронировать интересующие издания."
  },
  { 
    "id": 6, 
    "title": "Exam retake policy updated", 
    "author": "Dean's Office", 
    "type": "academic",
    "content": "Обновлена политика пересдачи экзаменов. Теперь студенты имеют право на пересдачу не более двух предметов за семестр. Пересдача проводится в течение двух недель после объявления результатов. Для допуска к пересдаче необходимо подать заявление в деканат не позднее чем за 3 дня до назначенной даты. Дополнительная информация в деканате."
  },
  { 
    "id": 7, 
    "title": "IT maintenance on Sunday", 
    "author": "IT Support", 
    "type": "technical",
    "content": "В воскресенье с 02:00 до 06:00 будет проводиться плановое техническое обслуживание IT-систем университета. В это время могут быть недоступны: корпоративная почта, система электронного документооборота, некоторые образовательные платформы. Приносим извинения за возможные неудобства. Рекомендуем сохранить важные документы заранее."
  },
  { 
    "id": 8, 
    "title": "Student Council elections", 
    "author": "Student Council", 
    "type": "event",
    "content": "Объявляется начало избирательной кампании в Студенческий совет. Выборы пройдут 25 декабря. Кандидаты могут подавать заявки до 20 декабря. Требования к кандидатам: хорошая успеваемость, активная общественная деятельность, отсутствие дисциплинарных взысканий. Голосование будет проводиться онлайн и в главном корпусе. Подробности на сайте студсовета."
  },
  { 
    "id": 9, 
    "title": "COVID-19 safety measures", 
    "author": "Health Center", 
    "type": "urgent",
    "content": "В связи с ростом заболеваемости COVID-19 в регионе вводится обязательное ношение масок во всех помещениях университета. Также усилены меры дезинфекции. Студенты с симптомами ОРВИ должны оставаться дома и обращаться к врачу. При положительном тесте на COVID-19 необходимо немедленно сообщить в медицинский центр университета."
  },
  { 
    "id": 10, 
    "title": "Lost & Found: keys", 
    "author": "Security", 
    "type": "general",
    "content": "В бюро находок находятся ключи от аудитории 305. Ключи были найдены вчера в столовой. Владелец может забрать их в кабинете охраны, предъявив документ, удостоверяющий личность. Также в бюро находок есть несколько забытых вещей: зонт, очки, флешка. Описание вещей можно получить у дежурного по охране."
  },
  { 
    "id": 11, 
    "title": "Winter break dates announced", 
    "author": "Registrar", 
    "type": "administrative",
    "content": "Утверждены даты зимних каникул: с 25 декабря по 8 января. Учебные занятия возобновятся 9 января. В период каникул библиотека будет работать по сокращенному графику. Студенческие общежития остаются открытыми. Для студентов, остающихся в городе, будет организована культурная программа. Подробное расписание мероприятий будет опубликовано позже."
  },
  { 
    "id": 12, 
    "title": "Chess tournament registration", 
    "author": "Sports Club", 
    "type": "event",
    "content": "Открыта регистрация на университетский шахматный турнир. Турнир пройдет 15-16 декабря в актовом зале. Участие могут принять студенты всех курсов. Регистрация до 10 декабря. Турнир будет проводиться по швейцарской системе. Призы для победителей: грамоты и ценные подарки. Для участия необходимо иметь базовые навыки игры в шахматы."
  },
  { 
    "id": 13, 
    "title": "New canteen menu", 
    "author": "Canteen", 
    "type": "general",
    "content": "Столовая обновила меню! Теперь в ассортименте появились новые блюда: вегетарианские варианты, диетические салаты, горячие супы. Цены остались прежними. Меню обновляется еженедельно. Студенты могут оставлять пожелания по меню в специальном ящике в столовой. Также введена система скидок для студентов с отличной успеваемостью."
  },
  { 
    "id": 14, 
    "title": "Graduation photo day", 
    "author": "PR Office", 
    "type": "event",
    "content": "Назначен день групповой фотографии для выпускников. Фотосессия состоится 20 декабря в 14:00 в актовом зале. Приглашаются все студенты выпускных курсов. Рекомендуется прийти в парадной одежде. Фотографии будут готовы через неделю. Стоимость одного фото - 200 тенге. Записаться на индивидуальную фотосессию можно у фотографа."
  },
  { 
    "id": 15, 
    "title": "Emergency contact update", 
    "author": "Admin", 
    "type": "urgent",
    "content": "Всем студентам необходимо обновить контактную информацию в личном кабинете. Особенно важно указать актуальные номера телефонов для экстренной связи. Также просим указать контакты ближайших родственников. Эта информация необходима для обеспечения безопасности студентов. Обновление данных займет не более 5 минут."
  },
  { 
    "id": 16, 
    "title": "Online learning tips", 
    "author": "IT Support", 
    "type": "technical",
    "content": "IT-отдел подготовил рекомендации по эффективному онлайн-обучению. Основные советы: обеспечьте стабильное интернет-соединение, используйте наушники для лучшего восприятия, подготовьте рабочее место, отключите уведомления на время занятий. Полный список рекомендаций доступен на сайте университета в разделе 'Дистанционное обучение'."
  },
  { 
    "id": 17, 
    "title": "Scholarship application deadline", 
    "author": "e-office", 
    "type": "administrative",
    "content": "Напоминаем о приближающемся сроке подачи заявок на стипендии. Документы принимаются до 30 декабря. Для подачи заявки необходимо: заявление, справка об успеваемости, рекомендации преподавателей, мотивационное письмо. Стипендии предоставляются на конкурсной основе. Результаты конкурса будут объявлены 15 января. Вопросы можно задать в e-office."
  },
  { 
    "id": 18, 
    "title": "Math Olympiad results", 
    "author": "Math Dept.", 
    "type": "academic",
    "content": "Подведены итоги университетской математической олимпиады. Победители: 1 место - Алиев А., 2 место - Бекова М., 3 место - Каримов Д. Все участники показали высокий уровень подготовки. Победители получат грамоты и призы на торжественной церемонии 25 декабря. Олимпиада помогла выявить талантливых студентов для участия в республиканских соревнованиях."
  },
  { 
    "id": 19, 
    "title": "Blood donation campaign", 
    "author": "Health Center", 
    "type": "event",
    "content": "Медицинский центр университета проводит акцию по сдаче крови. Акция пройдет 18 декабря с 9:00 до 17:00 в медицинском центре. К сдаче крови допускаются здоровые студенты старше 18 лет. Перед сдачей крови необходимо пройти медицинский осмотр. Каждый донор получит справку о сдаче крови и небольшое вознаграждение. Записаться можно заранее."
  },
  { 
    "id": 20, 
    "title": "Parking lot closure", 
    "author": "Security", 
    "type": "urgent",
    "content": "ВНИМАНИЕ! С 15 по 20 декабря будет закрыта основная парковка университета для проведения ремонтных работ. В это время автомобили можно парковать на дополнительной парковке за спортивным комплексом. Просим отнестись с пониманием к временным неудобствам. Ремонт необходим для улучшения безопасности парковки."
  },
  { 
    "id": 21, 
    "title": "Spring semester registration closed", 
    "author": "Registrar", 
    "type": "archive",
    "date": "2024-01-15",
    "content": "Регистрация на весенний семестр завершена. Все студенты, которые не успели зарегистрироваться, должны обратиться в деканат для решения вопроса о восстановлении. Дополнительная регистрация будет проводиться только в исключительных случаях при наличии уважительных причин."
  },
  { 
    "id": 22, 
    "title": "Last year's graduation ceremony", 
    "author": "PR Office", 
    "type": "archive",
    "date": "2023-06-25",
    "content": "Состоялась торжественная церемония вручения дипломов выпускникам 2023 года. В мероприятии приняли участие более 500 выпускников и их родственники. Церемония прошла в актовом зале университета. Все выпускники получили дипломы и памятные подарки. Фотографии с мероприятия доступны на сайте университета."
  },
  { 
    "id": 23, 
    "title": "Old library renovation completed", 
    "author": "Library", 
    "type": "archive",
    "date": "2023-12-10",
    "content": "Завершен капитальный ремонт старого здания библиотеки. Обновлены читальные залы, установлено новое оборудование, расширен книжный фонд. Библиотека теперь работает в полном объеме. Студенты могут пользоваться всеми услугами библиотеки, включая электронные ресурсы и межбиблиотечный абонемент."
  },
  { 
    "id": 24, 
    "title": "Previous IT system update", 
    "author": "IT Support", 
    "type": "archive",
    "date": "2023-11-20",
    "content": "Проведено обновление корпоративной IT-системы университета. Обновлены серверы, улучшена безопасность, добавлены новые функции в личный кабинет студента. Обновление прошло успешно, все системы работают стабильно. Студенты могут пользоваться всеми сервисами без ограничений."
  },
  { 
    "id": 25, 
    "title": "Summer internship program ended", 
    "author": "Career Center", 
    "type": "archive",
    "date": "2023-08-30",
    "content": "Завершилась летняя программа стажировок для студентов. В программе приняли участие более 200 студентов различных факультетов. Стажировки проводились в ведущих компаниях города. Многие студенты получили предложения о трудоустройстве. Программа будет продолжена в следующем году."
  },
  {
    "id": 26,
    "title": "Встреча с ректором",
    "author": "Ректорат",
    "type": "event",
    "content": "В эту пятницу состоится открытая встреча студентов с ректором университета. Приглашаются все желающие задать вопросы и обсудить актуальные темы."
  },
  {
    "id": 27,
    "title": "Открытие новой лаборатории",
    "author": "Деканат",
    "type": "academic",
    "content": "В корпусе B открылась новая лаборатория по робототехнике. Приглашаем студентов на экскурсию и мастер-класс в среду в 15:00."
  },
  {
    "id": 28,
    "title": "Важное обновление для всех студентов",
    "author": "Деканат",
    "type": "urgent",
    "content": "Уважаемые студенты! В связи с изменениями в расписании занятий просьба проверить обновленное расписание на сайте университета. Все изменения вступают в силу с завтрашнего дня. Если у вас возникли вопросы, обращайтесь в деканат."
  },
  {
    "id": 1001,
    "title": "Тест: Новый важный анонс (непрочитанный)",
    "author": "TestBot",
    "type": "urgent",
    "content": "Это тестовое важное объявление для проверки выделения непрочитанных анонсов и изменения названия категории."
  }
]
